In [26]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import datetime

In [14]:
pd.Timestamp('now')

Timestamp('2021-05-05 18:29:32.042620')

In [15]:
data = {'date': ['2014-05-01 18:47:05.069722', '2014-05-01 18:47:05.119994', '2014-05-02 18:47:05.178768', '2014-05-02 18:47:05.230071', '2014-05-02 18:47:05.230071', '2014-05-02 18:47:05.280592', '2014-05-03 18:47:05.332662', '2014-05-03 18:47:05.385109', '2014-05-04 18:47:05.436523', '2014-05-04 18:47:05.486877'],
        'battle_deaths': [34, 25, 26, 15, 15, 14, 26, 25, 62, 41]}
df = pd.DataFrame(data, columns = ['date', 'battle_deaths'])
df

                         date  battle_deaths
0  2014-05-01 18:47:05.069722             34
1  2014-05-01 18:47:05.119994             25
2  2014-05-02 18:47:05.178768             26
3  2014-05-02 18:47:05.230071             15
4  2014-05-02 18:47:05.230071             15
5  2014-05-02 18:47:05.280592             14
6  2014-05-03 18:47:05.332662             26
7  2014-05-03 18:47:05.385109             25
8  2014-05-04 18:47:05.436523             62
9  2014-05-04 18:47:05.486877             41

In [16]:
df['date'] = pd.to_datetime(df['date']) # change the date column to timestamp data type

In [17]:
df.index = df['date']
del df['date']
df

                            battle_deaths
date
2014-05-01 18:47:05.069722             34
2014-05-01 18:47:05.119994             25
2014-05-02 18:47:05.178768             26
2014-05-02 18:47:05.230071             15
2014-05-02 18:47:05.230071             15
2014-05-02 18:47:05.280592             14
2014-05-03 18:47:05.332662             26
2014-05-03 18:47:05.385109             25
2014-05-04 18:47:05.436523             62
2014-05-04 18:47:05.486877             41

In [18]:
df['2014']

<ipython-input-18-6f2fbef0951e>:1: FutureWarning: Indexing a DataFrame with a datetimelike index using a single string to slice the rows, like `frame[string]`, is deprecated and will be removed in a future version. Use `frame.loc[string]` instead.
  df['2014']

                            battle_deaths
date
2014-05-01 18:47:05.069722             34
2014-05-01 18:47:05.119994             25
2014-05-02 18:47:05.178768             26
2014-05-02 18:47:05.230071             15
2014-05-02 18:47:05.230071             15
2014-05-02 18:47:05.280592             14
2014-05-03 18:47:05.332662             26
2014-05-03 18:47:05.385109             25
2014-05-04 18:47:05.436523             62
2014-05-04 18:47:05.486877             41

In [19]:
df['2014-05']

<ipython-input-19-3435232da6ea>:1: FutureWarning: Indexing a DataFrame with a datetimelike index using a single string to slice the rows, like `frame[string]`, is deprecated and will be removed in a future version. Use `frame.loc[string]` instead.
  df['2014-05']

                            battle_deaths
date
2014-05-01 18:47:05.069722             34
2014-05-01 18:47:05.119994             25
2014-05-02 18:47:05.178768             26
2014-05-02 18:47:05.230071             15
2014-05-02 18:47:05.230071             15
2014-05-02 18:47:05.280592             14
2014-05-03 18:47:05.332662             26
2014-05-03 18:47:05.385109             25
2014-05-04 18:47:05.436523             62
2014-05-04 18:47:05.486877             41

In [35]:
df[pd.Timestamp(2014, 5, 3):] # all rows after 2014/05/02

                            battle_deaths
date
2014-05-03 18:47:05.332662             26
2014-05-03 18:47:05.385109             25
2014-05-04 18:47:05.436523             62
2014-05-04 18:47:05.486877             41

In [21]:
df['5/3/2014':'5/4/2014'] # passing all rows between two dates

                            battle_deaths
date
2014-05-03 18:47:05.332662             26
2014-05-03 18:47:05.385109             25
2014-05-04 18:47:05.436523             62
2014-05-04 18:47:05.486877             41

In [23]:
df.truncate(after='5/3/2014') #  remove or truncate all rows after May 2, 2014

                            battle_deaths
date
2014-05-01 18:47:05.069722             34
2014-05-01 18:47:05.119994             25
2014-05-02 18:47:05.178768             26
2014-05-02 18:47:05.230071             15
2014-05-02 18:47:05.230071             15
2014-05-02 18:47:05.280592             14

In [24]:
df.loc['5-2014'] # In this step we are using a different approach, the .loc method to view all rows in May of 2014.

                            battle_deaths
date
2014-05-01 18:47:05.069722             34
2014-05-01 18:47:05.119994             25
2014-05-02 18:47:05.178768             26
2014-05-02 18:47:05.230071             15
2014-05-02 18:47:05.230071             15
2014-05-02 18:47:05.280592             14
2014-05-03 18:47:05.332662             26
2014-05-03 18:47:05.385109             25
2014-05-04 18:47:05.436523             62
2014-05-04 18:47:05.486877             41

### The Timedelta Object

In [29]:
# The difference between two timestamp object in Python represented by Timedelta function

In [32]:
today = pd.Timestamp(2016,12,18)

In [33]:
today

Timestamp('2016-12-18 00:00:00')

In [36]:
tomorrow =today+pd.Timedelta(days=1) #'days' passes the differences between two dates
tomorrow

Timestamp('2016-12-19 00:00:00')

In [37]:
date1 = pd.Timestamp(2017,12,19)
date2=pd.Timestamp(2017,12,18)
date1 - date2

Timedelta('1 days 00:00:00')

### The Date Time Index
* by using date as an index we are able to build a time series data or in another world we can organize our observation based on time 
* by doing that our index object represented by 'DatetimeIndex'

In [38]:
dates =[pd.Timestamp(2014,8,1), pd.Timestamp(2014,8,2)]
ts=pd.Series(np.random.randn(2), dates)
ts

2014-08-01   -0.429135
2014-08-02   -0.321842
dtype: float64

In [39]:
type(ts.index)

pandas.core.indexes.datetimes.DatetimeIndex

In [40]:
type(ts.index[0]) # [0] It's a collection of timestamp for rows

pandas._libs.tslibs.timestamps.Timestamp

In [44]:
dti=pd.to_datetime(['Aug 1, 2014', '2014-08-02', '2014.08.03','08/03/2014','2014/03/09',  None])
dti
#pd.to_datetime change the string we pass in a list to timestamp object
# here you can see all different types of writing a data
# if the format of string doesn't match to default types pandas pass Nat(Not a Time)

DatetimeIndex(['2014-08-01', '2014-08-02', '2014-08-03', '2014-08-03',
               '2014-03-09', 'NaT'],
              dtype='datetime64[ns]', freq=None)

### Force a Data Conversion

In [45]:
pd.to_datetime(['Aug 1, 2014', 'foo'], errors='coerce') #errors='coerce' force the function to convert to dates

DatetimeIndex(['2014-08-01', 'NaT'], dtype='datetime64[ns]', freq=None)

In [47]:
s2=pd.Series([10,100,1000,10000], subset.index)
s2

NameError: name 'subset' is not defined

### The Frequency Parameters

In [53]:
np.random.seed(123456)
bymin=pd.Series(np.random.randn(41760),pd.date_range('2014-08-01', '2014-08-29 23:59', freq='T'))
# 'T' slicing by one minute, 'D' Slicing by day, 'B' for business day and so on and so forth
# the frequency only works with pd.date_range you pass the start and the end of the time period as well as frequency
# then it will chop the data according to the given frequency
bymin

2014-08-01 00:00:00    0.469112
2014-08-01 00:01:00   -0.282863
2014-08-01 00:02:00   -1.509059
2014-08-01 00:03:00   -1.135632
2014-08-01 00:04:00    1.212112
                         ...
2014-08-29 23:55:00   -0.707270
2014-08-29 23:56:00   -0.452294
2014-08-29 23:57:00   -0.812682
2014-08-29 23:58:00    0.457123
2014-08-29 23:59:00    2.339119
Freq: T, Length: 41760, dtype: float64

In [54]:
bymin['2014-08-01 00:02': '2014-08-01 00:10' ] #slicing by a minute

2014-08-01 00:02:00   -1.509059
2014-08-01 00:03:00   -1.135632
2014-08-01 00:04:00    1.212112
2014-08-01 00:05:00   -0.173215
2014-08-01 00:06:00    0.119209
2014-08-01 00:07:00   -1.044236
2014-08-01 00:08:00   -0.861849
2014-08-01 00:09:00   -2.104569
2014-08-01 00:10:00   -0.494929
Freq: T, dtype: float64

In [56]:
pd.date_range('2014-08-01 12:10:01', freq='S', periods=10)
# if we don't pass the end date then we need to define a periods which is equal to number of range we want o get
# then here freq tell us which criteria should be used for as the increment here 'S' or by second

DatetimeIndex(['2014-08-01 12:10:01', '2014-08-01 12:10:02',
               '2014-08-01 12:10:03', '2014-08-01 12:10:04',
               '2014-08-01 12:10:05', '2014-08-01 12:10:06',
               '2014-08-01 12:10:07', '2014-08-01 12:10:08',
               '2014-08-01 12:10:09', '2014-08-01 12:10:10'],
              dtype='datetime64[ns]', freq='S')

### Date Offsets

In [57]:
dti=pd.date_range('2014-08-29', '2014-09-05', freq='B')
dti.values

array(['2014-08-29T00:00:00.000000000', '2014-09-01T00:00:00.000000000',
       '2014-09-02T00:00:00.000000000', '2014-09-03T00:00:00.000000000',
       '2014-09-04T00:00:00.000000000', '2014-09-05T00:00:00.000000000'],
      dtype='datetime64[ns]')

In [59]:
dti.freq # check out the type of frequency

### Anchored Offsets
- we can also use anchored offset to get the specific date

In [60]:
fridays = pd.date_range('2016-06-01', '2016-08-31', freq = 'W-FRI')
fridays

DatetimeIndex(['2016-06-03', '2016-06-10', '2016-06-17', '2016-06-24',
               '2016-07-01', '2016-07-08', '2016-07-15', '2016-07-22',
               '2016-07-29', '2016-08-05', '2016-08-12', '2016-08-19',
               '2016-08-26'],
              dtype='datetime64[ns]', freq='W-FRI')

In [61]:
# freq = 'BQS-AUG' B for business day, Q for Quarterly and S for start
qends=pd.date_range('2016-01-01', '2016-12-31', freq='BQS-AUG')
qends
# what are all the business quarterly end dates in 2016
# after '-' we write our Anchor here is Augest

DatetimeIndex(['2016-02-01', '2016-05-02', '2016-08-01', '2016-11-01'], dtype='datetime64[ns]', freq='BQS-AUG')

### Period Object
* we can also looking at duration of time using period object
* Many useful mathematical operation on timeseries data required the advanced and specific time interval to be analysed. A simple example could be how many financial transactions occured in a specific period like a quarter 
* This can be performed using timestamp and date offset, where the bounds are calculated and items filtered based on that bounds. However it could be hard when you need to deal with events that must be grouped in a multiple periods of time as you need to manage sets of timestamps and date offset objects
* for doing so pandas make interval of times a formal construct usind 'pd.Period'
* Period is constructed by using timestamps and frequency where timestamp used as an anchor as the point of refrence and frequency as the duration of time

In [62]:
aug2016=pd.Period('2016-08', freq= 'M')
aug2016

Period('2016-08', 'M')

In [63]:
aug2016.start_time, aug2016.end_time

(Timestamp('2016-08-01 00:00:00'), Timestamp('2016-08-31 23:59:59.999999999'))

In [64]:
sep2016=aug2016+1 # we can use this timepriod to perform mathematical calculations
sep2016

Period('2016-09', 'M')